Repository: KDE/knights
Catalog: po/*/knights.po
Languages: eo, zh_cn

# NAME OF TRANSLATORS
source: Your names
eo: Axel Rousseau,Oliver Kellogg
zh_cn: 您的姓名

# EMAIL OF TRANSLATORS
source: Your emails
eo: axel@esperanto-jeunes.org,okellogg@users.sourceforge.net
zh_cn: 您的电子邮件

# @title:window
source: Promotion
eo: Promocio
zh_cn: 晋升

# @action:button
source: Promote
eo: Promocii

source: Black
eo: Nigra
zh_cn: 黑

source: White
eo: Blanka
zh_cn: 白

source: Search &depth:
eo: Serĉa profun&deco:
zh_cn: 搜索深度(&D)：

# Let the engine determine the search depth
source: Engine default
eo: Motora defaŭlto
zh_cn: 引擎默认

source: Memory &size:
eo: Memora grande&co:
zh_cn: 内存大小(&S)：

# Search depth suffix
source: move
eo: movo
zh_cn: 步

# @title:window
source: Difficulty Level
eo: Nivelo de Malfacileco
zh_cn: 难度

source: Auto detect
eo: Aŭtomata detekto
zh_cn: 自动检测

source: Add
eo: Aldoni
zh_cn: 添加

source: Remove
eo: Forpreni
zh_cn: 移除

source: Name
eo: Nomo
zh_cn: 名称

source: Command
eo: Komando
zh_cn: 命令

source: Protocol
eo: Protokolo
zh_cn: 协议

source: Installed
eo: Instalita
zh_cn: 已安装

# @title:window
source: New Game
eo: Nova ludo
zh_cn: 新游戏

# @item:valuesuffix
source: minute
eo: minuto

# @item:valuesuffix
source: second
eo: sekundo

# @item:valuesuffix
source: move
eo: movo

# @title:window
source: Chess Engines
eo: Ŝakmotoroj
zh_cn: 国际象棋引擎

source: Select a chess engine for the first player.
eo: Elektu ŝakmotoron por la unua ludanto.
zh_cn: 为第一名用户选择一个棋子引擎

source: Select a chess engine for the second player.
eo: Elektu ŝakmotoron por la dua ludanto.
zh_cn: 为第二名用户选择一个棋子引擎

source: Start the game.
eo: Komencu la ludon.
zh_cn: 开始游戏

source: Player 1
eo: Ludanto 1
zh_cn: 玩家1

source: Human (&You)
eo: Homo (&Vi)
zh_cn: 人类 (您) (&Y)

source: &Computer engine:
eo: &Komputila motoro:

source: Player 1's Color
eo: Koloro de Ludanto 1
zh_cn: 一号玩家的颜色

source: B&lack
eo: N&igra
zh_cn: 黑方

source: Choose r&andomly
eo: Elekti h&azarde
zh_cn: 随机选择(&A)

source: Player 2
eo: Ludanto 2
zh_cn: 二号玩家

source: H&uman
eo: H&omo
zh_cn: 人&类

source: Co&mputer engine:
eo: Ko&mputila motoro:

source: Chess server:
eo: Ŝakservilo:

source: &Use time control
eo: &Uzi tempokontrolon

source: &Time control period:
eo: &Tempkontrolperiodo:

# Time control mode
source: Timer Only
eo: Tempumilo Nur
zh_cn: 仅计时器

source: &Initial time limit:
eo: &Komenca tempolimo:

source: I&ncrement per move:
eo: Pl&igrandigo po movo:

# The player of this color
source: White
eo: Blanka
zh_cn: 白

# The player of this color
source: Black
eo: Negra
zh_cn: 黑

source: %1 offers you a draw
eo: %1 proponas al vi remizon
zh_cn: %1 请求和局

source: %2 would like to take back a half move
eo: %2 ŝatus repreni duonan movon
zh_cn: %2 想要反悔 %1 个半步

source: %1 would like to adjourn the game
eo: %1 ŝatus paŭzi la ludon
zh_cn: %1 想要暂停游戏

source: %1 would like to abort the game
eo: %1 ŝatus ĉesigi la ludon
zh_cn: %1 想要中止游戏

# string to be spoken when the opponent castles queenside
source: %1 castles queenside
eo: %1 kasteloj reĝinflanke
zh_cn: %1 后翼易位

# string to be spoken when the opponent castles queenside
source: %1 castles kingside
eo: %1 kasteloj reĝflanke
zh_cn: %1 王翼易位

# string to be spoken when the opponent makes a normal move
source: %1 to %2
eo: %1 ĝis %2
zh_cn: %1 至 %2

# Your king is under attack
source: Check
eo: Kontroli
zh_cn: 检查

# Your king is dead
source: Checkmate
eo: Mato
zh_cn: 将死

# @title:column
source: White
eo: Blanka

# @title:column
source: Black
eo: Nigra

source: New Column
eo: Nova Kolumno
zh_cn: 新建列

source: &Notation:
eo: &Notado:
zh_cn: 标示法(&N)：

source: Short Algebraic
eo: Mallonga Algebra
zh_cn: 短代数

source: Long Algebraic
eo: Longa Algebra
zh_cn: 长代数

source: Coordinate
eo: Koordinata
zh_cn: 座标

# @item difficulty
source: Custom
eo: Propra

source: %1 is thinking…
eo: %1 estas pensanta…

# @title:window
source: Clock
eo: Horloĝo

# @title:window Title of the list of all the moves made in the game
source: Move History
eo: Movi Historion

# @action
source: Resign
eo: Rezigni

# @info:tooltip
source: Admit your inevitable defeat
eo: Konfesu vian neeviteblan malvenkon

# @action
source: Undo
eo: Malfari

# @info:tooltip
source: Take back your last move
eo: Reprenu vian lastan movon

# @action
source: Redo
eo: Refari

# @info:tooltip
source: Repeat your last move
eo: Ripetu vian lastan movon

# @action
source: Offer &Draw
eo: Proponu &Paton

# @info:tooltip
source: Offer a draw to your opponent
eo: Proponu remizon al via kontraŭulo

# @action
source: Adjourn
eo: Paŭzi

# @info:tooltip
source: Continue this game at a later time
eo: Daŭrigi ĉi tiun ludon poste

# @action
source: Abort
eo: Ĉesigi

source: End the game immediately
eo: Fini la ludon tuj
zh_cn: 立即终结游戏

# @option:check
source: Show Clock
eo: Montri Horloĝon

# @option:check
source: Show History
eo: Montri Historion

# @option:check
source: Show White Console
eo: Montri Blankan Konzolon

# @option:check
source: Show Black Console
eo: Montri Nigran Konzolon

# @option:check
source: Show Chat
eo: Montri Babiladon

# @title:window
source: Open File
eo: Malfermi Dosieron

source: Portable game notation (*.pgn)
eo: Portebla ludnotacio (*.pgn)
zh_cn: 可移动游戏标记 (*.pgn)

# @title:tab
source: General
eo: Ĝenerala

# @title:tab
source: Computer Engines
eo: Komputilaj Motoroj

# @title:tab
source: Theme
eo: Etoso

source: Do you really want to resign?
eo: Ĉu vi vere volas rezigni?
zh_cn: 您真的确定要离开吗？

# @title:window
source: Resign
eo: Rezigni

# @action:button
source: Resign
eo: Rezigni

source: The game ended in a draw
eo: La ludo finiĝis en pato
zh_cn: 游戏以和局结束

# White as in the player with white pieces
source: The game ended with a victory for <em>White</em>
eo: La ludo finiĝis kun venko por <em>Blanko</em>
zh_cn: 游戏以 <em>白方</em>获胜而结束

# Black as in the player with black pieces
source: The game ended with a victory for <em>Black</em>
eo: La ludo finiĝis kun venko por <em>Nigro</em>
zh_cn: 游戏以<em>黑方</em>获胜而结束

# Player name, then <White as in the player with white pieces
source: The game ended with a victory for <em>%1</em>, playing White
eo: La ludo finiĝis kun venko por <em>%1</em>, ludante Blanka
zh_cn: 游戏以 <emphasis>%1</emphasis> 执白胜出结束

# Player name, then Black as in the player with black pieces
source: The game ended with a victory for <em>%1</em>, playing Black
eo: La ludo finiĝis kun venko por <em>%1</em>, ludante Nigre
zh_cn: 游戏以 <emphasis>%1</emphasis> 执黑胜出结束

# @title:window
source: %1 vs. %2
eo: %1 kontraŭ %2

source: This will end your game. Would you like to save the move history?
eo: Ĉi tio finos vian ludon. Ĉu vi ŝatus konservi la movadan historion?
zh_cn: 这将结束您的游戏。 您想要保存回合历史吗？

# @title:window
source: Save
eo: Konservi

# @title:window
source: Save As
eo: Konservi kiel
zh_cn: 另存为

source: Theme file for the board
eo: Etosdosiero por la tabulo
zh_cn: 用于棋盘的主题文件

source: whether to show a confirmation dialog before discarding game history
eo: ĉu montri konfirman dialogon antaŭ ol forĵeti ludohistorion
zh_cn: 是否在丢弃游戏历史前显示确认对话框

source: internal variable controlling the confirm dialog
eo: interna variablo reganta la konfirman dialogon
zh_cn: 内部变量控制着确认对话框

source: Moves animation speed
eo: Movas animacian rapidecon
zh_cn: 回合动画速度

source: whether the Board is animated during rotating and resizing
eo: ĉu la Tabulo estas vigla dum rotacio kaj aligrandigo
zh_cn: 在旋转和缩放时棋盘是否有动画

source: whether to rotate the board when in local two-player mode
eo: ĉu rotacii la tabulon kiam en loka du-ludanta reĝimo
zh_cn: 在本地双人模式时是否旋转棋盘

source: whether to play move sounds
eo: ĉu ludi movajn sonojn
zh_cn: 是否播放移动声效

source: chessboard border type
eo: ŝaktabula bordotipo
zh_cn: 棋盘边缘类型

source: show check marker
eo: montri kontrolmarkon
zh_cn: 显示将军记分员

source: show legal moves marker
eo: montri markilon de laŭleĝaj movoj
zh_cn: 显示合法回合记分员

source: show opponents move marker
eo: montri movmarkilon de kontraŭulo
zh_cn: 显示对手步数记分员

source: show clocks when time control is in use
eo: montri horloĝojn kiam temporeĝimo estas uzata
zh_cn: 当使用时间控制时显示时钟

source: show chat window, if supported by the protocol
eo: montri babilfenestron, se subtenata de la protokolo
zh_cn: 若协议支持则显示聊天窗口

source: show the text console, if supported by the protocol
eo: montri la tekstan konzolon, se subtenata de la protokolo
zh_cn: 若协议支持则显示文本控制台

source: show move history
eo: montri movadan historio
zh_cn: 显示回合历史

source: initial time limit for both players
eo: komenca tempolimo por ambaŭ ludantoj
zh_cn: 双方选手的初始时间限制

source: time increment per move (for Incremental time control)
eo: tempopliigo po movo (por Pliiga temporeĝimo)
zh_cn: 每步时间增量 (用于增量时间控制)

source: the number of moves the player has to make in the specified time (for Conventional time control)
eo: la nombro da movoj kiujn la ludanto devas fari en la specifita tempo (por Konvencia tempmastrumo)
zh_cn: 特定时间内玩家需走出的步数 (用于常规时间控制)

source: whether time limits are enabled and displayed
eo: ĉu tempolimoj estas ebligitaj kaj montrataj
zh_cn: 是否启用和显示时间限制

source: protocol to be used for player 1
eo: protokolo uzenda por ludanto 1
zh_cn: 要为一号玩家使用的协议

source: the local human player's color in a game against a computer or over the Internet.
eo: la koloro de la loka homa ludanto en ludo kontraŭ komputilo aŭ tra la Interreto.
zh_cn: 游戏中本地人类玩家相对电脑玩家的颜色或网络对战中相对其他人类玩家的颜色。

source: list of programs to run for playing against the computer
eo: listo de programoj ruleblaj por ludi kontraŭ la komputilo
zh_cn: 与电脑对战的程序列表

source: the last selected program for player 1
eo: la lasta elektita programo por ludanto 1
zh_cn: 为一号玩家最后选取的程序

source: the last selected program for player 2
eo: la lasta elektita programo por ludanto 2
zh_cn: 为二号玩家最后选取的程序

source: the search depth of computer engines, when the difficulty is set to Configurable
eo: la serĉprofundo de komputilaj motoroj, kiam la malfacileco estas metita al Agordebla
zh_cn: 当难度设为可配置时电脑引擎的搜索深度

source: the memory size used by computer engines, when the difficulty is set to Configurable
eo: la memorgrandeco uzata de komputilaj motoroj, kiam la malfacileco estas metita al Agordebla
zh_cn: 当难度设为可配置时电脑引擎所用的内存大小

source: list of servers for playing over the Internet
eo: listo de serviloj por ludi tra la Interreto
zh_cn: 网络对战所用的服务器列表

source: the last selected server
eo: la lasta elektita servilo
zh_cn: 最后选取的服务器

source: username for the Free Internet Chess Server
eo: uzantnomo por la Senpaga Interreta Ŝakservilo
zh_cn: 自由互联网国际象棋服务器的用户名

source: whether to log in as guest
eo: ĉu ensaluti kiel gasto
zh_cn: 是否以访客模式登录

source: whether to log in to chess server automatically
eo: ĉu aŭtomate ensaluti al ŝakservilo
zh_cn: 是否自动登录到国际象棋服务器

source: delay before a computer's move is reported, in milliseconds
eo: prokrasto antaŭ ol la movo de komputilo estas raportita, en milisekundoj
zh_cn: 以毫秒计的电脑行为的播报前延迟

source: stored configurations of engine-specific settings
eo: konservitaj agordoj de motor-specifaj agordoj
zh_cn: 引擎特殊设置的已保存配置

source: whether opponents' moves are spoken by Jovie
eo: ĉu la movoj de kontraŭuloj estas parolataj de Jovie
zh_cn: 是否使用 Jovie 播放对手行为

source: whether commands over D-Bus are accepted
eo: ĉu komandoj tra D-Bus estas akceptitaj
zh_cn: 是否接受通过 D-Bus 过来的命令

source: Move
eo: Movi
zh_cn: 步

source: Main Toolbar
eo: Ĉefa ilobreto
zh_cn: 主工具栏

source: Game Actions Toolbar
eo: Ilobreto de Ludaj Agoj
zh_cn: 游戏行为工具栏

source: Dockable Windows Toolbar
eo: Aldokebla Vindoza Ilobreto
zh_cn: 可停靠的窗口工具栏

source: Settings changed
eo: Agordoj ŝanĝiĝis
zh_cn: 设置已更改

source: KDE Chess Board
eo: Ŝaktabulo de KDE
zh_cn: KDE 国际象棋

source: Original Knights for KDE3 and theme author
eo: Origina aŭtoro de Knights por KDE3 kaj etoso
zh_cn: KDE 3 下原始 Knights 的开发者和主题作者

source: Help with new theme features and rendering without KGameRenderer
eo: Helpu pri novaj etosofunkcioj kaj bildigo sen KGameRenderer
zh_cn: 帮助开发了新的主题功能和不使用 KGameRenderer 的渲染

source: Clock displaying the remaining time
eo: Horloĝo montranta la restantan tempon
zh_cn: 开发了显示剩余时间的时钟

source: Document to open
eo: La dosiero malfermiĝi
zh_cn: 打开文档

# @action
source: Accept
eo: Akcepti

# @action
source: Decline
eo: Malakcepti

source: Accept
eo: Akcepti
zh_cn: 接受

source: Decline
eo: Malakcepti
zh_cn: 拒绝

source: Close
eo: Fermi
zh_cn: 关闭

source: External Programs
eo: Ekstera Programo
zh_cn: 外部程序

source: Speak opponent's moves
eo: Eldiri movojn de kontraŭanto
zh_cn: 播报对手行为

source: Allow other programs to control Knights
eo: Permesi aliajn programojn mastrumi Knights
zh_cn: 允许其他程序控制 Knights

source: Animations
eo: Animaciaĵoj
zh_cn: 动画

source: &Animation speed:
eo: &Animacia rapideco:
zh_cn: &动画速度:

source: Instant (no animation)
eo: Tuj (neniu animacio)
zh_cn: 即时(无动画)

source: Fast
eo: Rapida
zh_cn: 过程最快

source: Normal
eo: Normala
zh_cn: 普通窗口

source: Slow
eo: Malrapida
zh_cn: 慢速

source: Animate the board as well
eo: Animacii la tabulon ankaŭ
zh_cn: 同时使用棋盘动画

source: Appearance
eo: Aspekto
zh_cn: 外观

source: Show &markers for:
eo: Montri &markilojn por:
zh_cn: 显示下列记分员(&M)：

# Option to show markers for
source: Legal moves
eo: Leĝaj movoj
zh_cn: 合法回合

# Option to show markers for
source: Opponent's move
eo: Movo de kontraŭulo
zh_cn: 对手回合

# Option to show markers for
source: Check
eo: Marki
zh_cn: 检查

source: Border display:
eo: Bordbildigo:
zh_cn: 边缘显示：

source: No borders
eo: Neniuj bordoj
zh_cn: 无边框

source: Only borders
eo: Nur bordoj
zh_cn: 仅边框

source: Borders and notation
eo: Bordoj kaj notado
zh_cn: 边框和标示法

source: Behavior
eo: Konduto
zh_cn: 行为

source: Play sounds
eo: Ludi sonojn
zh_cn: 播放声音

source: Flip the board in local matches between humans
eo: Turni la tabulon en lokaj konkursoj inter homoj
zh_cn: 本地人类竞赛时旋转棋盘

source: Show confirmation dialog before closing
eo: Montri konfirman dialogon antaŭ fermo
zh_cn: 关闭前显示确认对话框

source: Pawn Promotion
eo: Peona Promocio
zh_cn: 兵升变

source: Promote pawn to:
eo: Antaŭenigi peonon al:
zh_cn: 将兵升变为：

source: &Queen
eo: &Damo
zh_cn: 皇后

source: Roo&k
eo: &Turo
zh_cn: 烟雾(&K)

source: B&ishop
eo: Kur&iero
zh_cn: 主&教

source: &Knight
eo: &Kavaliro
zh_cn: &骑士

source: says:
eo: diras:
zh_cn: 说：

source: You:
eo: Vi:
zh_cn: 您：

source: Send
eo: Sendu
zh_cn: 发送

source: Program <code>%1</code> could not be started, please check that it is installed.
eo: Programo <code>%1</code> ne eblis komenciĝi, bonvolu kontroli ke ĝi estas instalita.
zh_cn: 程序 <code>%1</code> 无法启动，请检查它是否安装。

source: Console for %1 (%2)
eo: Konzolo por %1 (%2)
zh_cn: 用于 %1 的控制台 (%2)

source: Session started
eo: Seanco komenciĝis
zh_cn: 会话启动

source: Logging in…
eo: Ensalutante…

source: <font color='red'>Error: %1</font>
eo: <font color='red'>Eraro: %1</font>
zh_cn: <font color='red'>错误：%1</font>

source: Account
eo: Konto
zh_cn: 账户

source: Log in to the chess server
eo: Ensalutu al la ŝakservilo
zh_cn: 登录到国际象棋服务器

source: &Username:
eo: &Uzantnomo:

source: This is a registered account
eo: Ĉi tio estas registrita konto
zh_cn: 这是一个已注册的账户

source: &Password:
eo: &Pasvorto:

source: Log me in automatically
eo: Ensalutu min aŭtomate
zh_cn: 自动登录

source: Log in
eo: Ensaluti
zh_cn: 登录

source: Create an account
eo: Krei konton
zh_cn: 创建账户

source: Seek List
eo: Serĉlisto
zh_cn: 查询列表

source: Current ads arranged in a list
eo: Aktualaj reklamoj aranĝitaj en listo
zh_cn: 目前列表中的战书

source: Player
eo: Ludanto
zh_cn: 玩家

source: Rating
eo: Noto
zh_cn: 等级

source: Time
eo: Tempo
zh_cn: 时间

source: Increment
eo: Pliigo
zh_cn: 增加

source: Rated
eo: Taksita
zh_cn: 等级

source: Variant
eo: Variaĵo
zh_cn: 变化程度

source: Your color
eo: Via koloro
zh_cn: 您的颜色

source: Seek Graph
eo: Serĉa Grafeo
zh_cn: 查询图像

source: Current ads arranged by rating and duration
eo: Aktualaj reklamoj aranĝitaj laŭ takso kaj daŭro
zh_cn: 目前按等级和持续时间排列的战书

source: Challenges
eo: Defioj
zh_cn: 邀战

source: Post an ad for other players
eo: Afiŝi reklamon por aliaj ludantoj
zh_cn: 向其他玩家发出战书

source: Rated match
eo: Taksita konkurso
zh_cn: 等级匹配

source: Automatically start the game
eo: Aŭtomate komenci la ludon
zh_cn: 自动开始游戏

# Start searching for opponents
source: Seek
eo: Serĉi
zh_cn: 查询

source: Console
eo: Konzolo
zh_cn: 控制台

source: Use custom commands
eo: Uzi proprajn komandojn
zh_cn: 使用自定义命令

# Stop searching for opponents
source: Unseek
eo: Malserĉi
zh_cn: 取消查询

source: Help
eo: Helpo
zh_cn: 帮助

source: Server Console
eo: Servila Konzolo
zh_cn: 服务器控制台

source: Chat with %1
eo: Babili kun %1
zh_cn: 与 %1 聊天

source: Login failed
eo: Ensaluto malsukcesis
zh_cn: 登录失败

# @title:window
source: Chess server
eo: Ŝakservilo
zh_cn: 国际象棋服务器

source: Invalid Password
eo: Nevalida pasvorto
zh_cn: 无效密码

source: No Error
eo: Neniu Eraro
zh_cn: 无错误

source: User Canceled
eo: Uzanto Nuligis
zh_cn: 用户取消

source: Network Error
eo: Reta Eraro
zh_cn: 网络错误

source: Unknown Error
eo: Nekonata eraro
zh_cn: 未知错误

source: Program Error
eo: Eraro de Programo
zh_cn: 程序错误

source: Time limit [minutes]
eo: Tempolimo [minutoj]
zh_cn: 时间限制 [分钟]

source: Opponent's rating
eo: Takso de kontraŭulo
zh_cn: 对手等级

source: Promote
zh_cn: 晋升

source: minute
zh_cn: 分

source: second
zh_cn: 秒

source: move
zh_cn: 步

source: white
zh_cn: 白

source: black
zh_cn: 黑

source: Custom
zh_cn: 自定义

source: %1 is thinking...
zh_cn: %1 正在思考...

source: Clock
zh_cn: 时钟

# @title:window
source: Move History
zh_cn: 回合历史

source: Resign
zh_cn: 认输

source: Admit your inevitable defeat
zh_cn: 承认您的必输之局

source: Undo
zh_cn: 撤销

source: Take back your last move
zh_cn: 回到您的上一步

source: Redo
zh_cn: 重下

source: Repeat your last move
zh_cn: 重复您的上一步

source: Offer &Draw
zh_cn: 提请和局(&D)

source: Offer a draw to your opponent
zh_cn: 向您的对手提请和局

source: Adjourn
zh_cn: 暂停

source: Continue this game at a later time
zh_cn: 稍后再继续此局游戏

source: Abort
zh_cn: 中止

source: Show Clock
zh_cn: 显示时钟

source: Show History
zh_cn: 显示历史

source: Show White Console
zh_cn: 显示白方控制台

source: Show Black Console
zh_cn: 显示黑方控制台

source: Show Chat
zh_cn: 显示聊天界面

source: Open File
zh_cn: 打开文件

source: General
zh_cn: 通用

source: Computer Engines
zh_cn: 电脑引擎

source: Theme
zh_cn: 主题

# @title:window
source: Game over
zh_cn: 游戏结束

source: %1 vs. %2
zh_cn: %1 对 %2

source: Save
zh_cn: 保存文档

source: Alexander Semke
zh_cn: 亚历山大塞姆克

source: Logging in...
zh_cn: 正在登录...
